layer {
  name: "data"
  type: "Python"
  top: "rgb"
  top: "depth"
  top: "label"
  python_param {
    module: "data_layers.rgbd_data_layer"
    layer: "RGBDDataLayer"
    param_str: "{\'img_size\': (224, 224), \'split\': \'test\', \'dataset_dir\': \'/home/kevin/dataset/rgbd\', \'randomize\': False, \'mean\': (104.00698793, 116.66876762, 122.67891434), \'seed\': 1337, \'batch_size\': 1, \'crop_size\': (224, 224, 224, 224)}"
  }
}
layer {
  name: "rgb_conv1"
  type: "Convolution"
  bottom: "rgb"
  top: "rgb_conv1"
  param {
    name: "rgb_conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb_conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 11
    group: 1
    stride: 4
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu1"
  type: "ReLU"
  bottom: "rgb_conv1"
  top: "rgb_conv1"
}
layer {
  name: "rgb_pool1"
  type: "Pooling"
  bottom: "rgb_conv1"
  top: "rgb_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "rgb_norm1"
  type: "LRN"
  bottom: "rgb_pool1"
  top: "rgb_norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "rgb_conv2"
  type: "Convolution"
  bottom: "rgb_norm1"
  top: "rgb_conv2"
  param {
    name: "rgb_conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb_conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu2"
  type: "ReLU"
  bottom: "rgb_conv2"
  top: "rgb_conv2"
}
layer {
  name: "rgb_pool2"
  type: "Pooling"
  bottom: "rgb_conv2"
  top: "rgb_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "rgb_norm2"
  type: "LRN"
  bottom: "rgb_pool2"
  top: "rgb_norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "rgb_conv3"
  type: "Convolution"
  bottom: "rgb_norm2"
  top: "rgb_conv3"
  param {
    name: "rgb_conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb_conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu3"
  type: "ReLU"
  bottom: "rgb_conv3"
  top: "rgb_conv3"
}
layer {
  name: "rgb_conv4"
  type: "Convolution"
  bottom: "rgb_conv3"
  top: "rgb_conv4"
  param {
    name: "rgb_conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb_conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu4"
  type: "ReLU"
  bottom: "rgb_conv4"
  top: "rgb_conv4"
}
layer {
  name: "rgb_conv5"
  type: "Convolution"
  bottom: "rgb_conv4"
  top: "rgb_conv5"
  param {
    name: "rgb_conv5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb_conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu5"
  type: "ReLU"
  bottom: "rgb_conv5"
  top: "rgb_conv5"
}
layer {
  name: "rgb_pool5"
  type: "Pooling"
  bottom: "rgb_conv5"
  top: "rgb_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "rgb_fc6"
  type: "InnerProduct"
  bottom: "rgb_pool5"
  top: "rgb_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu6"
  type: "ReLU"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
}
layer {
  name: "rgb_drop6"
  type: "Dropout"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "rgb_fc7"
  type: "InnerProduct"
  bottom: "rgb_fc6"
  top: "rgb_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_relu7"
  type: "ReLU"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
}
layer {
  name: "rgb_drop7"
  type: "Dropout"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "rgb_fc8"
  type: "InnerProduct"
  bottom: "rgb_fc7"
  top: "rgb_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 11
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_conv1"
  type: "Convolution"
  bottom: "depth"
  top: "depth_conv1"
  param {
    name: "depth_conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "depth_conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu1"
  type: "ReLU"
  bottom: "depth_conv1"
  top: "depth_conv1"
}
layer {
  name: "depth_pool1"
  type: "Pooling"
  bottom: "depth_conv1"
  top: "depth_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "depth_norm1"
  type: "LRN"
  bottom: "depth_pool1"
  top: "depth_norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "depth_conv2"
  type: "Convolution"
  bottom: "depth_norm1"
  top: "depth_conv2"
  param {
    name: "depth_conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "depth_conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu2"
  type: "ReLU"
  bottom: "depth_conv2"
  top: "depth_conv2"
}
layer {
  name: "depth_pool2"
  type: "Pooling"
  bottom: "depth_conv2"
  top: "depth_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "depth_norm2"
  type: "LRN"
  bottom: "depth_pool2"
  top: "depth_norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "depth_conv3"
  type: "Convolution"
  bottom: "depth_norm2"
  top: "depth_conv3"
  param {
    name: "depth_conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "depth_conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu3"
  type: "ReLU"
  bottom: "depth_conv3"
  top: "depth_conv3"
}
layer {
  name: "depth_pool3"
  type: "Pooling"
  bottom: "depth_conv3"
  top: "depth_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "depth_conv4"
  type: "Convolution"
  bottom: "depth_pool3"
  top: "depth_conv4"
  param {
    name: "depth_conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "depth_conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu4"
  type: "ReLU"
  bottom: "depth_conv4"
  top: "depth_conv4"
}
layer {
  name: "depth_conv5"
  type: "Convolution"
  bottom: "depth_conv4"
  top: "depth_conv5"
  param {
    name: "depth_conv5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "depth_conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu5"
  type: "ReLU"
  bottom: "depth_conv5"
  top: "depth_conv5"
}
layer {
  name: "depth_pool5"
  type: "Pooling"
  bottom: "depth_conv5"
  top: "depth_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "depth_fc6"
  type: "InnerProduct"
  bottom: "depth_pool5"
  top: "depth_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu6"
  type: "ReLU"
  bottom: "depth_fc6"
  top: "depth_fc6"
}
layer {
  name: "depth_drop6"
  type: "Dropout"
  bottom: "depth_fc6"
  top: "depth_fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "depth_fc7"
  type: "InnerProduct"
  bottom: "depth_fc6"
  top: "depth_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "depth_relu7"
  type: "ReLU"
  bottom: "depth_fc7"
  top: "depth_fc7"
}
layer {
  name: "depth_drop7"
  type: "Dropout"
  bottom: "depth_fc7"
  top: "depth_fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "depth_fc8"
  type: "InnerProduct"
  bottom: "depth_fc7"
  top: "depth_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 11
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "rgb_accuracy"
  type: "Accuracy"
  bottom: "rgb_fc8"
  bottom: "label"
  top: "rgb_accuracy"
}
layer {
  name: "rgb_loss"
  type: "SoftmaxWithLoss"
  bottom: "rgb_fc8"
  bottom: "label"
  top: "rgb_loss"
}
layer {
  name: "depth_accuracy"
  type: "Accuracy"
  bottom: "depth_fc8"
  bottom: "label"
  top: "depth_accuracy"
}
layer {
  name: "depth_loss"
  type: "SoftmaxWithLoss"
  bottom: "depth_fc8"
  bottom: "label"
  top: "depth_loss"
}
